# HaveNoPermissionToEdit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..HaveNoPermissionToEdit Property
BuiltInFailures..::..EditingFailures Class See Also
---
You do not have permission to edit the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HaveNoPermissionToEdit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HaveNoPermissionToEdit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HaveNoPermissionToEdit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace